<a href="https://colab.research.google.com/github/umi-na/google_colab/blob/main/topic_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ÌÜ†ÌîΩ #4: ·ÑÉ·Ö¶·Ñã·Öµ·Ñê·Ö• Ï†ÑÏ≤òÎ¶¨ - ·ÑÉ·Ö¶·Ñã·Öµ·Ñê·Ö• ÏàòÏ†ï, ÏÑ†ÌÉù

Colab Ïã§Ïäµ ÏãúÏûë Ï†Ñ, Ïù¥ ÎÖ∏Ìä∏Î∂ÅÏùò **Î≥µÏÇ¨Î≥∏ÏùÑ ÏûêÏã†Ïùò Íµ¨Í∏Ä ÎìúÎùºÏù¥Î∏åÏóê Ï†ÄÏû•**Ìï®: Colab Î©îÎâ¥ÏóêÏÑú "File" >> "Save a Copy in Drive". "Save a Copy" Î©îÎâ¥ ÏÑ†ÌÉù Ïãú "Copy of topic#4.ipynb" Î≥µÏÇ¨Î≥∏Ïù¥ Íµ¨Í∏Ä ÎìúÎùºÏù¥Î∏åÏùò 'Colab Notebook' Ìè¥ÎçîÏóê Ï†ÄÏû•Îê®. Í∑∏Î¶¨Í≥† Î≥∏ÏÇ¨Î≥∏Ïù¥ ÏÉà Î∏åÎùºÏö∞Ï†Ä Ï∞ΩÏóê Ïó¥Î¶º.

# ÏàòÏóÖÎ™©Ìëú

* Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞ Î≥µÏäµ (2Ï£ºÏ∞® ÏàòÏóÖ)

* Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞ Í≥†Í∏â

* ÏàúÏ∞®Ï†ÅÏúºÎ°ú Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞

* Îç∞Ïù¥ÌÑ∞ ÌïÑÌÑ∞ÎßÅ (ÌäπÏ†ï Ï°∞Í±¥ÏùÑ ÎßåÏ°±ÌïòÎäî Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞; e.g., ÎÇòÏù¥Í∞Ä 19ÏÇ¥ Ïù¥ÏÉÅÏù∏ ÏÇ¨Îûå)

* Îç∞Ïù¥ÌÑ∞ ÏàòÏ†ï

# ÏàòÏóÖ Îç∞Ïù¥ÌÑ∞ ÏÜåÍ∞ú

## ÌÉÄÏù¥ÌÉÄÎãâ ÌÉëÏäµÍ∞ù Îç∞Ïù¥ÌÑ∞

* Î≥∏ ÏàòÏóÖÏóêÏÑúÎèÑ [ÌÉÄÏù¥ÌÉÄÎãâ ÌÉëÏäµÍ∞ù Îç∞Ïù¥ÌÑ∞](https://drive.google.com/drive/folders/1KpfVquLkXBRByHmpwCvxHYpbpj7sebki?usp=sharing)Î•º ÌôúÏö©ÌïòÍ≤†Ïùå.

* ÌÉëÏäµÍ∞ù Îç∞Ïù¥ÌÑ∞Î•º Îã§Ïö¥Î∞õÏïÑ Íµ¨Í∏Ä ÎìúÎùºÏù¥Î∏åÏóê ÏóÖÎ°úÎìúÌïòÏó¨ ÏÇ¨Ïö©ÌïòÎ©¥ Îê®

* ÌÉëÏäµÍ∞ù Îç∞Ïù¥ÌÑ∞Ïùò ÏûêÏÑ∏Ìïú ÏÑ§Î™ÖÏùÄ [Wk#3 ÏΩîÎû©](https://colab.research.google.com/drive/1rn0JqKKVeagdFY-DriMhqIiU2drUeEAg?usp=sharing) Ï∞∏Ï°∞

## Íµ¨Í∏Ä ÎìúÎùºÏù¥Î∏å ÎßàÏö¥Ìä∏

* Íµ¨Í∏Ä ÎìúÎùºÏù¥Î∏åÏóê ÏóÖÎ°úÎìúÌïú Îç∞Ïù¥ÌÑ∞Î•º ÏÇ¨Ïö©ÌïòÍ∏∞ ÏúÑÌï¥ ÎìúÎùºÏù¥Î∏åÎ•º ÎßàÏö¥Ìä∏Ìï®

* ÏïÑÎûò Í∑∏Î¶ºÏ≤òÎüº (1) => (2) ÏàúÏúºÎ°ú ÌÅ¥Î¶≠ÌïòÎ©¥ ÎìúÎùºÏù¥Î∏åÍ∞Ä ÎßàÏö¥Ìä∏Îê®(ÏûêÏÑ∏Ìïú ÏÑ§Î™ÖÏùÄ [Wk#1 ÏΩîÎû©](https://colab.research.google.com/drive/1-28UPcDO68IGnwZ0SeuG_jnvMQ--oL6E?usp=sharing) Ï∞∏Ï°∞)

![CSV Screenshot](https://drive.google.com/uc?export=view&id=1L56f9PIcVxMCLjonPgqJl2PKzasw4TY8)

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

## Íµ¨Í∏Ä ÎìúÎùºÏù¥Î∏å Ìè¥Îçî Í≤ΩÎ°ú ÏÑ§Ï†ï

* ÏïÑÎûò root_pathÏùò Ïä§Ìä∏ÎßÅÍ∞íÏùÄ ÌååÏùºÏù¥ ÏûàÎäî Íµ¨Í∏Ä ÎìúÎùºÏù¥Î∏å Ìè¥Îçî Í≤ΩÎ°úÎ•º ÎÇòÌÉÄÎÉÑ 

* ÏûêÏã†ÏóêÍ≤å ÎßûÍ≤å Íµ¨Í∏Ä ÎìúÎùºÏù¥Î∏å Ìè¥Îçî Í≤ΩÎ°úÎ•º Î≥ÄÍ≤ΩÌïòÏó¨ ÏÇ¨Ïö©ÌïòÎ©¥ Îê®

In [ ]:
root_path = '/content/drive/MyDrive/Colab Notebooks/Colab/wk3_data'

* ÏïÑÎûò Îç∞Ïù¥ÌÑ∞Îäî ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞Î•º DataFrameÏúºÎ°ú ÏùΩÏñ¥ÏôÄ Î≥¥Ïó¨Ï£ºÎäî ÏΩîÎìúÏûÑ

* Íµ¨Í∏Ä ÎìúÎùºÏù¥Î∏å ÎßàÏö¥Ìä∏ Î∞è Ìè¥Îçî Í≤ΩÎ°úÍ∞Ä ÎòëÎ∞îÎ°ú ÏÑ§Ï†ïÎêòÎã§Î©¥ Ïò§Î•ò ÏóÜÏù¥ Ïã§ÌñâÎê®

In [ ]:
import pandas as pd
from os import path

def getTitanicData():
  return pd.read_csv(path.join(root_path,'titanic.csv'))

df = getTitanicData()
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       3  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]

# Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞ Î≥µÏäµ (ÌÜ†ÌîΩ#2 ÏàòÏóÖ)

* DataFrameÏùò (1) Column Îç∞Ïù¥ÌÑ∞ (2) Raw Îç∞Ïù¥ÌÑ∞ (3) Îã®Ïùº Îç∞Ïù¥ÌÑ∞Î•º ÏùΩÎäî Î∞©Î≤ïÏóê ÎåÄÌï¥ Î∞∞Ïõ†Ïùå

* Îç∞Ïù¥ÌÑ∞ ÌïÑÌÑ∞ÎßÅÎ•º Î∞∞ÏúÑÍ∏∞ Ï†ÑÏóê Î∞∞Ïö¥ ÎÇ¥Ïö©ÏùÑ Î≥µÏäµÌïòÍ≤†Ïùå

![CSV Screenshot](https://drive.google.com/uc?export=view&id=1sMOwUG8VgkWLLmgSOhFZTMmXCUfn10nZ)

## Column Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞

* DataFrame[$column\_name$]

* DataFrame[[$column\_name_0$, $column\_name_1$]]

In [ ]:
df['PassengerId']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [ ]:
df[['PassengerId', 'Pclass']]

     PassengerId  Pclass
0              1       3
1              2       1
2              3       3
3              4       1
4              5       3
..           ...     ...
886          887       2
887          888       1
888          889       3
889          890       1
890          891       3

[891 rows x 2 columns]


## Row Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞

* Row Îç∞Ïù¥ÌÑ∞ ÏùΩÎäî Î∞©Î≤ïÏùÄ Ï∂îÌõÑ Îç∞Ïù¥ÌÑ∞ ÌïÑÌÑ∞ÎßÅÏóêÏÑú ÏÇ¨Ïö©Îê®

  * DataFrame[ $index_{ÏãúÏûëÎ≤àÌò∏}$ : $index _{ÎÅùÎ≤àÌò∏}$ ]

  * DataFrame.loc[ ùëñùëõùëëùëíùë•_Í∞í} ]

  * DataFrame.loc[ [$index\_Í∞í_0$, $index\_Í∞í_1$] ]

  * DataFrame.iloc[ ùëñùëõùëëùëíùë•_Î≤àÌò∏ ]
  
  * DataFrame.iloc[ [$index\_Î≤àÌò∏_0$, $index\_Î≤àÌò∏_1$]]

* DataFrame[ $index_{ÏãúÏûëÎ≤àÌò∏}$ : $index _{ÎÅùÎ≤àÌò∏}$ ]

In [ ]:
df[0:4]

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       3  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S

[4 rows x 9 columns]

* DataFrame.loc[ ùëñùëõùëëùëíùë•_Í∞í ]

* DataFrame.loc[ [$index\_Í∞í_0$, $index\_Í∞í_1$] ]

In [ ]:
df.loc[0] #location

PassengerId           2
Survived              1
Pclass                1
Sex              female
Age                  38
Ticket         PC 17599
Fare            71.2833
Cabin               C85
Embarked              C
Name: 1, dtype: object

In [ ]:
df.loc[[0,3]]

   PassengerId  Survived  Pclass     Sex  ...     Ticket     Fare  Cabin Embarked
0            1         0       3    male  ...  A/5 21171   7.2500    NaN        S
3            4         1       1  female  ...     113803  53.1000   C123        S
5            6         0       3    male  ...     330877   8.4583    NaN        Q

[3 rows x 9 columns]

* DataFrame.iloc[ ùëñùëõùëëùëíùë•_Î≤àÌò∏ ]
  
* DataFrame.iloc[ [$index\_Î≤àÌò∏_0$, $index\_Î≤àÌò∏_1$]]

In [ ]:
df.iloc[0]

PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   22
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: 0, dtype: object

In [ ]:
df.iloc[[0, 3]]

   PassengerId  Survived  Pclass     Sex   Age     Ticket   Fare Cabin Embarked
0            1         0       3    male  22.0  A/5 21171   7.25   NaN        S
3            4         1       1  female  35.0     113803  53.10  C123        S

## Îã®Ïùº Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞

* DataFrame.at[ $indexÍ∞í$, $column\_name$ ]

* DataFrame.iat[ $index\_Î≤àÌò∏$, $column\_Î≤àÌò∏$ ]

In [ ]:
df.at[0,'Ticket']

'A/5 21171'

In [ ]:
df.iat[0, 5]

'A/5 21171'

# Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞ Í≥†Í∏â: ÌäπÏ†ï Row ÌäπÏ†ï Column Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞

* DataFrame.loc ÎòêÎäî DataFrame.ilocÎ•º ÏÇ¨Ïö©ÌïòÏó¨ Row Îç∞Ïù¥ÌÑ∞Î•º ÏùΩÎäî Î∞©Î≤ïÏóê ÎåÄÌï¥ Î∞∞Ïõ†Ïùå

* DataFrame.loc ÎòêÎäî DataFrame.ilocÏùÄ ÏïÑÎûòÏôÄ Í∞ôÏù¥ Í∞úÎ≥Ñ rowÏùÑ Î≥¥Ïó¨Ï§Ñ Îïå Ï†ÑÏ≤¥ Ïª¨Îüº Í∞íÎì§ÏùÑ Î≥¥Ïó¨Ï§å

PassengerId| Survived| Pclass| Sex| Age| Ticket| Fare| Cabin| Embarked
---| ---| ---| ---| ---| ---| ---| ---| ---
0| 1| 0| 3| male| 22.0| A/5 21171| 7.25| NaN| S

* Ï†ÑÏ≤¥ Ïª¨Îüº Í∞íÎì§Ïù¥ ÏïÑÎãà ÌäπÏ†ï Ïª¨Îüº Í∞íÎì§Îßå ÏùΩÎäî Î∞©Î≤ïÏùÑ Î∞∞Ïö∞Í≤†Ïùå

## DataFrame.loc[Ïù∏Îç±Ïä§_Í∞í, Ïª¨Îüº_Ïù¥Î¶Ñ]

* DataFrame.locÎ°ú RowÏùò Í∞íÏùÑ ÏùΩÏùÑ Îïå Ïù∏Îç±Ïä§_Í∞íÎßå ÎÑ£Ïñ¥Ï§¨Ïùå
* Ïù∏Îç±Ïä§_Í∞í Îí§Ïóê ÏâºÌëúÏôÄ Ïª¨Îüº_Ïù¥Î¶ÑÏùÑ ÎÑ£Ïñ¥Ï£ºÎ©¥ RowÎç∞Ïù¥ÌÑ∞Î•º Î≥¥Ïó¨Ï§Ñ Îïå Ìï¥Îãπ Ïª¨ÎüºÏùò Îç∞Ïù¥ÌÑ∞ Í∞íÎßå Î≥¥Ïó¨Ï§å

In [ ]:
df = getTitanicData()
df.loc[0, 'Pclass']

3

* Î≥¥Ïó¨Ï£ºÍ≥† Ïã∂ÏùÄ Ïª¨ÎüºÏù¥ ÎëêÍ∞ú Ïù¥ÏÉÅÏù¥Î©¥ Î¶¨Ïä§Ìä∏Î°ú ÎÑ£ÏúºÎ©¥ Îê®

In [ ]:
df.loc[0, ['Pclass', 'Age']]

Pclass     3
Age       22
Name: 0, dtype: object

* 2Í∞ú Ïù¥ÏÉÅÏùò ÌäπÏ†ï rowÏùò Îç∞Ïù¥ÌÑ∞ Í∞íÏùÑ Î≥¥Í≥† Ïã∂ÏùÑ ÎïåÎäî 'ÏãúÏûë_row : ÎÅù_row'Î•º ÎÑ£Ïñ¥Ï£ºÎ©¥ Îê®
* Ïù¥ Î∞©ÏãùÏùÄ indexÍ∞Ä Ïà´ÏûêÏùº ÎïåÎßå Í∞ÄÎä•Ìï®

In [ ]:
df.loc[0:2, ['Pclass', 'Age']]

   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0

* ÌäπÏ†ï rowÍ∞Ä ÏïÑÎãå Ï†ÑÏ≤¥ rowÏùò Îç∞Ïù¥ÌÑ∞ Í∞íÏùÑ Î≥¥Í≥† Ïã∂ÏùÑ Îïå ':' Î•º ÎÑ£Ïñ¥Ï£ºÎ©¥ Îê®

In [ ]:
df.loc[:, ['Pclass', 'Age']]

     Pclass   Age
0         3  22.0
1         1  38.0
2         3  26.0
3         1  35.0
4         3  35.0
..      ...   ...
886       2  27.0
887       1  19.0
888       3   NaN
889       1  26.0
890       3  32.0

[891 rows x 2 columns]

In [ ]:
df.loc[[0, 2], ['Pclass', 'Age']]

   Pclass   Age
0       3  22.0
2       3  26.0

## DataFrame.iloc[Ïù∏Îç±Ïä§_Î≤àÌò∏, Ïª¨Îüº_Î≤àÌò∏]]

* DataFrame.ilocÎèÑ DataFrame.locÏôÄ Ïú†ÏÇ¨ÌïòÍ≤å ÏÇ¨Ïö© Í∞ÄÎä•Ìï®

In [ ]:
df = getTitanicData()
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
df.iloc[0, 2]

3

In [ ]:
df.iloc[0, [2, 3]]

Pclass       3
Sex       male
Name: 0, dtype: object

In [ ]:
df.iloc[0:2, [2, 3]]

   Pclass     Sex
0       3    male
1       1  female

In [ ]:
df.iloc[:, [2, 3]]

     Pclass     Sex
0         3    male
1         1  female
2         3  female
3         1  female
4         3    male
..      ...     ...
886       2    male
887       1  female
888       3  female
889       1    male
890       3    male

[891 rows x 2 columns]

In [ ]:
df.iloc[[0, 1], [2, 3]]

   Pclass     Sex
0       3    male
1       1  female

# ÏàúÏ∞®Ï†ÅÏúºÎ°ú Ï†ÑÏ≤¥ Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞

## DataFrame.items

In [ ]:
df = getTitanicData()[:3]
df

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       3  ...   7.9250    NaN        S

[3 rows x 9 columns]

In [ ]:
for label, content in df.items():
  print(label)

PassengerId
Survived
Pclass
Sex
Age
Ticket
Fare
Cabin
Embarked

In [ ]:
df = getTitanicData()[:3]
for label, content in df.iteritems():
  print(content)

0    1
1    2
2    3
Name: PassengerId, dtype: int64
0    0
1    1
2    1
Name: Survived, dtype: int64
0    3
1    1
2    3
Name: Pclass, dtype: int64
0      male
1    female
2    female
Name: Sex, dtype: object
0    22.0
1    38.0
2    26.0
Name: Age, dtype: float64
0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
Name: Ticket, dtype: object
0     7.2500
1    71.2833
2     7.9250
Name: Fare, dtype: float64
0    NaN
1    C85
2    NaN
Name: Cabin, dtype: object
0    S
1    C
2    S
Name: Embarked, dtype: object

## DataFrame.iterrows

In [ ]:
df = getTitanicData()[:3]
for row in df.iterrows():
  print(row)

(0, PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   22
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: 0, dtype: object)
(1, PassengerId           2
Survived              1
Pclass                1
Sex              female
Age                  38
Ticket         PC 17599
Fare            71.2833
Cabin               C85
Embarked              C
Name: 1, dtype: object)
(2, PassengerId                   3
Survived                      1
Pclass                        3
Sex                      female
Age                          26
Ticket         STON/O2. 3101282
Fare                      7.925
Cabin                       NaN
Embarked                      S
Name: 2, dtype: object)

In [ ]:
df = getTitanicData()[:3]
for index, data in df.iterrows():
  print(index)

0
1
2

In [ ]:
df = getTitanicData()[:3]
for index, data in df.iterrows():
  print(data)

PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   22
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: 0, dtype: object
PassengerId           2
Survived              1
Pclass                1
Sex              female
Age                  38
Ticket         PC 17599
Fare            71.2833
Cabin               C85
Embarked              C
Name: 1, dtype: object
PassengerId                   3
Survived                      1
Pclass                        3
Sex                      female
Age                          26
Ticket         STON/O2. 3101282
Fare                      7.925
Cabin                       NaN
Embarked                      S
Name: 2, dtype: object

## DataFrame.itertuples

In [ ]:
df = getTitanicData()[:3]
for row in df.itertuples():
  print(row)

Pandas(Index=0, PassengerId=1, Survived=0, Pclass=3, Sex='male', Age=22.0, Ticket='A/5 21171', Fare=7.25, Cabin=nan, Embarked='S')
Pandas(Index=1, PassengerId=2, Survived=1, Pclass=1, Sex='female', Age=38.0, Ticket='PC 17599', Fare=71.2833, Cabin='C85', Embarked='C')
Pandas(Index=2, PassengerId=3, Survived=1, Pclass=3, Sex='female', Age=26.0, Ticket='STON/O2. 3101282', Fare=7.925, Cabin=nan, Embarked='S')

# Îç∞Ïù¥ÌÑ∞ ÌïÑÌÑ∞ÎßÅ (ÌäπÏ†ï Î∂ÄÎ∂Ñ Îç∞Ïù¥ÌÑ∞ ÏùΩÍ∏∞)

* ÏõêÌïòÎäî Ï°∞Í±¥Ïóê Ìï¥ÎãπÌïòÎäî Îç∞Ïù¥ÌÑ∞Îßå Í∞ÄÏ†∏Ïò§Í≥† Ïã∂ÏùÑÎïåÍ∞Ä ÎßéÏùå. Ïù¥Îü¥Îïå ÌïÑÌÑ∞ÎßÅ Í∏∞Îä•Ïù¥ Ïú†Ïö©Ìï®

* ÌïÑÌÑ∞ÎßÅÏùÑ ÌïòÎäî Î∞©Î≤ïÏùÄ Îã§ÏñëÌï®. ÎåÄÌëúÏ†ÅÏù∏ ÌïÑÌÑ∞ÎßÅ Î∞©Î≤ïÏóê ÎåÄÌï¥ Î∞∞Ïö∞Í≤†Ïùå

## DataFrame[ Ï°∞Í±¥Î¨∏ ]

* DataFrame[ $index_{ÏãúÏûëÎ≤àÌò∏}$ : $index _{ÎÅùÎ≤àÌò∏}$ ]Î°ú Îç∞Ïù¥ÌÑ∞ RowÎ•º ÏùΩÎäî Î≤ïÏùÑ Î∞∞Ïõ†Ïùå

* $index_{ÏãúÏûëÎ≤àÌò∏}$ : $index _{ÎÅùÎ≤àÌò∏}$ ÎåÄÏã† Ï°∞Í±¥Î¨∏ÏùÑ ÎÑ£Ïñ¥ ÌïÑÌÑ∞ÎßÅÏùÑ Ìï† Ïàò ÏûàÏùå (e.g., DataFrame[ Ï°∞Í±¥Î¨∏ ])

* Ï°∞Í±¥Î¨∏ÏùÄ Ï∞∏(True) ÎòêÎäî Í±∞Ïßì(False)ÏùÑ Î∞òÌôòÌï®. DataFrame[ Ï°∞Í±¥Î¨∏ ]Îäî Ï°∞Í±¥Î¨∏Ïù¥ TrueÎ•º Î∞òÌôòÌïòÎäî RowÎßå Î≥¥Ïó¨Ï§å

### Ï°∞Í±¥Î¨∏(Conditional Statement) 

* ÎπÑÍµê Ïó∞ÏÇ∞ÏûêÎ•º ÌôúÏö©ÌïòÏó¨ Ï°∞Í±¥Î¨∏ÏùÑ ÎßåÎì§Ïàò ÏûàÏùå. ÏÇ¨Ïö© Í∞ÄÎä•Ìïú ÎπÑÍµê Ïó∞ÏÇ∞ÏûêÎäî ÏïÑÎûò ÌëúÏôÄ Í∞ôÏùå

* ÎπÑÍµê Ïó∞ÏÇ∞ÏûêÎäî Îëê ÌîºÏó∞ÏÇ∞Ïûê (e.g., A vs. B) ÏÇ¨Ïù¥Ïùò ÏÉÅÎåÄÏ†ÅÏù∏ ÌÅ¨Í∏∞Î•º ÌåêÎã®Ìï® 

ÎπÑÍµê Ïó∞ÏÇ∞Ïûê|	ÏÑ§Î™Ö
---| ---
A **==** B|  AÏôÄ BÎäî **Í∞ôÎã§**
A **!=** B| AÏôÄ BÎäî **Îã§Î•¥Îã§**
A **<** B| AÎäî B Î≥¥Îã§ **ÏûëÎã§**
A **<=** B| AÎäî B Î≥¥Îã§ **ÏûëÍ±∞ÎÇò Í∞ôÎã§**
A **>** B| AÎäî BÎ≥¥Îã§ **ÌÅ¨Îã§**
A **>=** B| AÎäî BÎ≥¥Îã§ **ÌÅ¨Í±∞ÎÇò Í∞ôÎã§**


### ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞ ÌïÑÌÑ∞ÎßÅ

* ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞Î•º ÌôúÏö©ÌïòÏó¨ Îç∞Ïù¥ÌÑ∞ ÌïÑÌÑ∞ÎßÅ ÌïòÎäî Î≤ïÏóê ÎåÄÌï¥ Î∞∞Ïö∞Í≤†Ïùå

* ÌïÑÌÑ∞ÎßÅ Ï°∞Í±¥Î¨∏(e.g., ÏÉùÏ°¥Ìï® ÏÇ¨ÎûåÎßå ÌïÑÌÑ∞ÎßÅ: Survived == 1)ÏùÑ ÏÑ§Ï†ïÌïòÍ∏∞ ÏúÑÌï¥ÏÑúÎäî columnÎ≥Ñ Îç∞Ïù¥ÌÑ∞ Ï†ïÎ≥¥ ÏïåÍ≥† ÏûàÏñ¥Ïïº Ìï®

* ÌÉÄÏù¥ÎÇòÎãâ column Ï†ïÎ≥¥Îäî ÏïÑÎûòÌëúÏôÄ Í∞ôÏùå

Ïª¨Îüº Ïù¥Î¶Ñ|	ÏÑ§Î™Ö|	Ïª¨ÎüºÍ∞í ÏÑ§Î™Ö
---| ---| ---
PassengerId| ÌÉëÏäπÍ∞ù Î≤àÌò∏| 
Survived|	ÏÉùÏ°¥Ïú†Î¨¥|	0 = ÏÇ¨Îßù, 1 = ÏÉùÏ°¥
pclass|	Ìã∞Ïºì Í∏ÄÎûòÏä§|	1 = 1Îì±ÏÑù, 2 = 2Îì±ÏÑù, 3 = 3Îì±ÏÑù
Sex|	ÏÑ±Î≥Ñ| Female = Ïó¨ÏÑ±, Male = ÎÇ®ÏÑ±	
Age|	Îßå ÎÇòÏù¥ | ÌÉúÏñ¥ÎÇúÏßÄ 1ÎÖÑ ÎØ∏ÎßåÏúºÎ©¥(Îßå ÎÇòÏù¥ < 0) ÏÜåÏàòÎ°ú ÌëúÌòÑ
Ticket|	Ìã∞Ïºì Î≤àÌò∏|	
Fare|	Ìã∞Ïºì Í∞ÄÍ≤©|	
Cabin|	Í∞ùÏã§ Î≤àÌò∏|	
Embarked|	ÌÉëÏäπ Ìï≠Íµ¨|	C = ÏÖ∞Î•¥Î∂ÄÎ•¥(ÌîÑÎûëÏä§ ÏÑúÎ∂ÅÎ∂Ä Ìï≠Íµ¨), Q = ÌÄ∏Ï¶àÌÉÄÏö¥(ÏïÑÏùºÎûúÎìú ÎÇ®Î∂ÄÏùò Ìï≠Íµ¨), S = ÏÇ¨Ïö∞ÏÉòÌîÑÌÑ¥ (ÏòÅÍµ≠ ÎÇ®Î∂Ä Ìï≠Íµ¨)

In [ ]:
df = getTitanicData()
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       3  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]


* Survived Ïª¨ÎüºÏùÄ ÌÉëÏäπÍ∞ùÏùò ÏÉùÏ°¥Ïú†Î¨¥Î•º ÎÇòÌÉÄÎÇ®. Survived Ï†ïÎ≥¥Î•º ÌôúÏö©ÌïòÏó¨ ÏÉùÏ°¥Ìïú ÌÉëÏäπÍ∞ùÎßå ÎÇòÌÉÄÎÇòÎèÑÎ°ù ÌïÑÌÑ∞ÎßÅÌïòÍ≤†Ïùå

* ÏÉùÏ°¥ÏûêÎäî Survived Ïª¨ÎüºÍ∞íÏù¥ '1'ÏûÑ. Îî∞ÎùºÏÑú 'df.SurvivedÏù¥ == 1'ÎùºÎäî Ï°∞Í±¥Î¨∏ÏùÑ ÎßåÎì§Î©¥ Îê®.

* 'df.Survived == 1'Îäî Survied Ïª¨ÎüºÍ∞íÏù¥ 1ÏùºÎïå TrueÏùÑ Î∞òÌôòÌï®

In [ ]:
df.Survived == 1

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: Survived, Length: 891, dtype: bool

* Ï∞∏Í≥†Î°ú df.Survived Îäî df['Survived']Ï≤òÎüº Survived Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º Î≥¥Ïó¨Ï§å

In [ ]:
df.Survived.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [ ]:
df['Survived'].head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

* Ï∂îÌõÑ df[df.Survived == 1] Ïã§Ìñâ Ïãú Ï°∞Í±¥Î¨∏Ïù¥ TrueÏù∏ RowÎßå Î≥¥Ïó¨Ï£ºÎäîÏßÄ ÏïåÏïÑÎ≥¥Í∏∞ ÏúÑÌï¥ Ï°∞Í±¥Î¨∏ Î∞òÌôòÍ∞íÏùÑ Î≥¥Ïó¨Ï£ºÎäî Ïª¨ÎüºÏùÑ ÎßåÎì§Í≤†Ïùå

* ÏïÑÎûò ÏΩîÎìúÎäî 'isSurvived'Ïù¥ÎùºÎäî ÏÉàÎ°úÏö¥ Ïª¨ÎüºÏùÑ ÏÉùÏÑ± ÌõÑ 'df.Survived == 1'Ïùò Î∞òÌôòÍ∞í(i.e., True/False)ÏùÑ Îç∞Ïù¥ÌÑ∞Î°ú ÎÑ£Ïùå

* isSurvived Ïª¨ÎüºÏùÄ DataFrameÏùò Í∞ÄÏû• ÎßàÏßÄÎßâÏóê ÏûàÏùå

In [ ]:
df['isSurvived'] = df.Survived == 1
df

     PassengerId  Survived  Pclass     Sex  ...     Fare Cabin  Embarked isSurvived
0              1         0       3    male  ...   7.2500   NaN         S      False
1              2         1       1  female  ...  71.2833   C85         C       True
2              3         1       3  female  ...   7.9250   NaN         S       True
3              4         1       1  female  ...  53.1000  C123         S       True
4              5         0       3    male  ...   8.0500   NaN         S      False
..           ...       ...     ...     ...  ...      ...   ...       ...        ...
886          887         0       2    male  ...  13.0000   NaN         S      False
887          888         1       1  female  ...  30.0000   B42         S       True
888          889         0       3  female  ...  23.4500   NaN         S      False
889          890         1       1    male  ...  30.0000  C148         C       True
890          891         0       3    male  ...   7.7500   NaN         Q      False

[891 rows x 10 columns]

* ÏïÑÎûò ÏΩîÎìúÏùò Í≤∞Í≥ºÎ•º Î≥¥Î©¥ df['df.Survived == 1']Îäî 'df.Survived == 1'Í∞Ä TrueÎ•º Í∞ÄÏßÄÎäî RowÎßå Î≥¥Ïó¨Ï§åÏùÑ ÏïåÏàò ÏûàÏùå

* Ïúó ÏΩîÎìúÏùò Í≤∞Í≥ºÎ•º Î≥¥Î©¥ isSurvived Ïª¨ÎüºÏóê TrueÏôÄ False Î™®ÎëêÍ∞Ä ÎÇòÏôÄ ÏûàÏßÄÎßå ÏïÑÎûò Í≤∞Í≥ºÎ•º Î≥¥Î©¥ TrueÎßå ÏûàÏùå

In [ ]:
df[df.Survived == 1]

     PassengerId  Survived  Pclass     Sex  ...     Fare Cabin  Embarked isSurvived
1              2         1       1  female  ...  71.2833   C85         C       True
2              3         1       3  female  ...   7.9250   NaN         S       True
3              4         1       1  female  ...  53.1000  C123         S       True
8              9         1       3  female  ...  11.1333   NaN         S       True
9             10         1       2  female  ...  30.0708   NaN         C       True
..           ...       ...     ...     ...  ...      ...   ...       ...        ...
875          876         1       3  female  ...   7.2250   NaN         C       True
879          880         1       1  female  ...  83.1583   C50         C       True
880          881         1       2  female  ...  26.0000   NaN         S       True
887          888         1       1  female  ...  30.0000   B42         S       True
889          890         1       1    male  ...  30.0000  C148         C       True

[342 rows x 10 columns]

## DataFrame[ Ï°∞Í±¥Î¨∏$_A$ & Ï°∞Í±¥Î¨∏$_B$ ]

* Ï°∞Í±¥Î¨∏ÏùÑ ÌïúÍ∞ú Ïù¥ÏÉÅ ÎÑ£Ïñ¥ ÌïÑÌÑ∞ÎßÅÏùÑ Ìï† Ïàò ÏûàÏùå (e.g., DataFrame[ Ï°∞Í±¥Î¨∏ & Ï°∞Í±¥Î¨∏ ])

* Ï°∞Í±¥Î¨∏Ïù¥ ÎëêÍ∞ú Ïù¥ÏÉÅÏùº ÎïåÎäî Ï°∞Í±¥Î¨∏ ÏÇ¨Ïù¥Ïóê ÎÖºÎ¶¨ Ïó∞ÏÇ∞ÏûêÎ•º ÎÑ£Ïñ¥Ïïº Ìï®. Í∑∏Î¶¨Í≥† Í∞úÎ≥Ñ Ï°∞Í±¥Î¨∏ÏùÄ Í¥ÑÌò∏ÏïàÏóê Îì§Ïñ¥ÏóàÏñ¥Ïïº Ìï®: e.g., df[(df.Sex == 'male') & (20 <= df.Age )]

#### ÎÖºÎ¶¨ Ïó∞ÏÇ∞Ïûê(Logical Operator)

* ÎÖºÎ¶¨ Ïó∞ÏÇ∞ÏûêÎ•º Îëê Ï°∞Í±¥Î¨∏ ÏÇ¨Ïù¥Ïóê ÎÑ£Ïñ¥ Ï°∞Í±¥Î¨∏ÏùÑ Îçî Îã§ÏñëÌïòÍ≤å ÎßåÎì§ Ïàò ÏûàÏùå: e.g., (A == B) & (B != C)

* ÎÖºÎ¶¨ Ïó∞ÏÇ∞ÏûêÎ°ú Îã§Ïùå 3Í∞ÄÏßÄÎ•º ÏÇ¨Ïö©Ìï† Ïàò ÏûàÏùå: & (AND; Í∑∏Î¶¨Í≥†), | (OR; ÎòêÎäî), ! (NOT; ÏïÑÎãàÎã§)

* ÎÖºÎ¶¨ Ïó∞ÏÇ∞Ïûê ÏÇ¨Ïö©ÏòàÎäî ÏïÑÎûòÌëúÏôÄ Í∞ôÏùå


ÎÖºÎ¶¨ Ïó∞ÏÇ∞Ïûê| ÏÑ§Î™Ö| ÏÇ¨Ïö© ÏòàÏãú| ÏÑ§Î™Ö
---| --- | --- | ---
& | (A == B) & (B != C) | ÏïûÎí§ Î™®Îì† Ï°∞Í±¥Î¨∏ÏùÑ ÎßåÏ°±Ìï¥Ïïº Ï∞∏Ïù¥Îê® |AÏôÄ BÎäî Í∞ôÍ≥† BÎäî CÏôÄ Îã§Î•¥Îã§
\| | (A == B) \| (B != C) | ÏïûÎí§ Ï°∞Í±¥Î¨∏ Ï§ë ÌïúÍ∞úÎßå ÎßåÏ°±ÌïòÎ©¥ Ï∞∏Ïù¥Îê®|AÏôÄ BÎäî Í∞ôÍ±∞ÎÇò BÎäî CÏôÄ Îã§Î•¥Îã§
! | !(A == B) | Ï°∞Í±¥Î¨∏ Í±∞ÏßìÏù¥Î©¥ Ï∞∏Ïù¥Îê® |AÏôÄ BÎäî Í∞ôÏùÄ Í≤ÉÏù¥ ÏïÑÎãàÎã§ (AÏôÄ BÎäî Îã§Î•¥Îã§)

#### ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞ ÌïÑÌÑ∞ÎßÅ

In [ ]:
df = getTitanicData()
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       3  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]

* ÌÉÄÏù¥ÌÉÄÎãâ Îç∞Ïù¥ÌÑ∞ÏóêÏÑú 3Îì±ÏÑù ÌÉëÏäπÍ∞ù Ï§ë ÏÉùÏ°¥Ìïú ÌÉëÏäπÍ∞ùÎßå Ï∞æÍ≥† Ïã∂Ïùå

* Ï¶â Ìã∞Ïºì Í∏ÄÎûòÏä§Í∞Ä 3Îì±ÏÑù(df.Pclass == 3)Ïù¥Í≥†(&) ÏÉùÏ°¥Ïú†Î¨¥Îäî ÏÉùÏ°¥Ïù∏ ÌÉëÏäπÍ∞ù(df.Survived == 1)ÏûÑ

In [ ]:
df[(df.Pclass == 3) & (df.Survived == 1)]

     PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
2              3         1       3  ...   7.9250    NaN        S
8              9         1       3  ...  11.1333    NaN        S
10            11         1       3  ...  16.7000     G6        S
19            20         1       3  ...   7.2250    NaN        C
22            23         1       3  ...   8.0292    NaN        Q
..           ...       ...     ...  ...      ...    ...      ...
838          839         1       3  ...  56.4958    NaN        S
855          856         1       3  ...   9.3500    NaN        S
858          859         1       3  ...  19.2583    NaN        C
869          870         1       3  ...  11.1333    NaN        S
875          876         1       3  ...   7.2250    NaN        C

[119 rows x 9 columns]

* Îã§ÏùåÏúºÎ°ú ÌÉÄÏù¥ÌÉÄÌã± ÏÉùÏ°¥ÏûêÏù¥Î©¥ÏÑú Ïó¨ÏÑ±Ïù¥Í≥† ÎÇòÏù¥Í∞Ä 40ÏÇ¥ Ïù¥ÏÉÅÏù¥ÏòÄÎçò ÌÉëÏäπÍ∞ùÏùÑ Ï∞æÏïÑÎ≥¥Í≤†Ïùå

In [ ]:
result = df[(df.Survived == 1) & (df.Sex == 'female') & (40 <= df.Age)]
result

     PassengerId  Survived  Pclass  ...      Fare    Cabin Embarked
11            12         1       1  ...   26.5500     C103        S
15            16         1       2  ...   16.0000      NaN        S
52            53         1       1  ...   76.7292      D33        C
161          162         1       2  ...   15.7500      NaN        S
194          195         1       1  ...   27.7208       B4        C
195          196         1       1  ...  146.5208      B80        C
259          260         1       2  ...   26.0000      NaN        S
268          269         1       1  ...  153.4625     C125        S
272          273         1       2  ...   19.5000      NaN        S
275          276         1       1  ...   77.9583       D7        S
299          300         1       1  ...  247.5208  B58 B60        C
319          320         1       1  ...  134.5000      E34        C
337          338         1       1  ...  134.5000      E40        C
346          347         1       2  ...   13.0000      NaN        S
366          367         1       1  ...   75.2500      D37        C
380          381         1       1  ...  227.5250      NaN        C
432          433         1       2  ...   26.0000      NaN        S
440          441         1       2  ...   26.2500      NaN        S
458          459         1       2  ...   10.5000      NaN        S
483          484         1       3  ...    9.5875      NaN        S
496          497         1       1  ...   78.2667      D20        C
513          514         1       1  ...   59.4000      NaN        C
523          524         1       1  ...   57.9792      B18        C
526          527         1       2  ...   10.5000      NaN        S
556          557         1       1  ...   39.6000      A16        C
571          572         1       1  ...   51.4792     C101        S
591          592         1       1  ...   78.2667      D20        C
609          610         1       1  ...  153.4625     C125        S
670          671         1       2  ...   39.0000      NaN        S
706          707         1       2  ...   13.5000      NaN        S
754          755         1       2  ...   65.0000      NaN        S
765          766         1       1  ...   77.9583      D11        S
774          775         1       2  ...   23.0000      NaN        S
779          780         1       1  ...  211.3375       B3        S
796          797         1       1  ...   25.9292      D17        S
820          821         1       1  ...   93.5000      B69        S
829          830         1       1  ...   80.0000      B28      NaN
856          857         1       1  ...  164.8667      NaN        S
862          863         1       1  ...   25.9292      D17        S
865          866         1       2  ...   13.0000      NaN        S
871          872         1       1  ...   52.5542      D35        S
879          880         1       1  ...   83.1583      C50        C

[42 rows x 9 columns]

* ÌïÑÌÑ∞ÎßÅ Í≤∞Í≥ºÎ°ú Ï¥ù 42Î™ÖÏùò ÌÉëÏäπÍ∞ùÏù¥ ÎÇòÏôîÏùå

In [ ]:
len(result)

42

* Îã§ÏùåÏúºÎ°ú ÌÉÄÏù¥ÌÉÄÌã± ÏÉùÏ°¥ÏûêÏù¥Î©¥ÏÑú Ïó¨ÏÑ±Ïù¥Í≥† ÎÇòÏù¥Í∞Ä 40ÏÇ¥ Ïù¥ÏÉÅÏù¥ÏòÄÎçò ÌÉëÏäπÍ∞ù Ï§ë 2Îì±ÏÑù ÌÉëÏäπÍ∞ùÏùÑ Ï∞æÏïÑÎ≥¥Í≤†Ïùå

* Î∞îÎ°ú Ï†Ñ DataFrame Í≤∞Í≥ºÎäî " ÌÉÄÏù¥ÏïÑÌã± ÏÉùÏ°¥ÏûêÏù¥Î©¥ÏÑú Ïó¨ÏÑ±Ïù¥Í≥† ÎÇòÏù¥Í∞Ä 40ÏÇ¥ Ïù¥ÏÉÅÏù¥ÏòÄÎçò ÌÉëÏäπÍ∞ù"ÏùÑ Î≥¥Ïó¨Ï§å.Ïù¥ DataFrameÎ•º Ïû¨ÌôúÏö©Ìï¥ÏÑú ÌïÑÌÑ∞ÎßÅ ÌïòÍ≤†Ïùå

In [ ]:
result[result.Pclass == 2]

     PassengerId  Survived  Pclass     Sex  ...        Ticket   Fare  Cabin Embarked
15            16         1       2  female  ...        248706  16.00    NaN        S
161          162         1       2  female  ...    C.A. 33595  15.75    NaN        S
259          260         1       2  female  ...        230433  26.00    NaN        S
272          273         1       2  female  ...        250644  19.50    NaN        S
346          347         1       2  female  ...         31418  13.00    NaN        S
432          433         1       2  female  ...    SC/AH 3085  26.00    NaN        S
440          441         1       2  female  ...  F.C.C. 13529  26.25    NaN        S
458          459         1       2  female  ...  F.C.C. 13531  10.50    NaN        S
526          527         1       2  female  ...   W./C. 14258  10.50    NaN        S
670          671         1       2  female  ...         29750  39.00    NaN        S
706          707         1       2  female  ...        223596  13.50    NaN        S
754          755         1       2  female  ...        220845  65.00    NaN        S
774          775         1       2  female  ...         29105  23.00    NaN        S
865          866         1       2  female  ...        236852  13.00    NaN        S

[14 rows x 9 columns]

* Îã§ÏùåÏúºÎ°ú ÏÑ∏Î•¥Î∂ÄÎ•¥ ÎòêÎäî ÏøºÏ¶àÌÉÄÏö¥ÏóêÏÑú ÌÉëÏäπÌïú ÏäπÍ∞ù Ï§ë ÏÉùÏ°¥ÏûêÎ•º Ï∞æÍ≤†Ïùå

In [ ]:
df[((df.Embarked == 'C') | (df.Embarked == 'Q')) & (df.Survived == 1) ]

     PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
1              2         1       1  ...  71.2833    C85        C
9             10         1       2  ...  30.0708    NaN        C
19            20         1       3  ...   7.2250    NaN        C
22            23         1       3  ...   8.0292    NaN        Q
28            29         1       3  ...   7.8792    NaN        Q
..           ...       ...     ...  ...      ...    ...      ...
866          867         1       2  ...  13.8583    NaN        C
874          875         1       2  ...  24.0000    NaN        C
875          876         1       3  ...   7.2250    NaN        C
879          880         1       1  ...  83.1583    C50        C
889          890         1       1  ...  30.0000   C148        C

[123 rows x 9 columns]

## DataFrame.loc[Ï°∞Í±¥Î¨∏]

* DataFrame.loc Î©îÏÜåÏä§ÏùÑ ÏÇ¨Ïö©ÌïòÏó¨ ÌïÑÌÑ∞ÎßÅ ÌïòÎäî Î≤ïÏùÑ Î∞∞Ïö∞Í≤†Ïùå. DataFrame.loc[ ùëñùëõùëëùëíùë•_Í∞í ]Î°ú Îç∞Ïù¥ÌÑ∞ RowÎ•º ÏùΩÎäî Î≤ïÏùÑ Î∞∞Ïõ†Ïùå

* ùëñùëõùëëùëíùë•_Í∞í ÎåÄÏã† Ï°∞Í±¥Î¨∏ÏùÑ ÎÑ£Ïñ¥ ÌïÑÌÑ∞ÎßÅÏùÑ Ìï† Ïàò ÏûàÏùå (e.g., DataFrame.loc[ Ï°∞Í±¥Î¨∏ ])

* ÏïÑÎûò ÏΩîÎìúÎäî ÏÉùÏ°¥Ìïú ÌÉÄÏù¥ÌÉÄÎãâ ÌÉëÏäµÍ∞ùÏùÑ ÌïÑÌÑ∞ÌïòÏó¨ Î≥¥Ïó¨Ï§å

In [ ]:
df = getTitanicData()
df.loc[df.Survived == 1]

     PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
1              2         1       1  ...  71.2833    C85        C
2              3         1       3  ...   7.9250    NaN        S
3              4         1       1  ...  53.1000   C123        S
8              9         1       3  ...  11.1333    NaN        S
9             10         1       2  ...  30.0708    NaN        C
..           ...       ...     ...  ...      ...    ...      ...
875          876         1       3  ...   7.2250    NaN        C
879          880         1       1  ...  83.1583    C50        C
880          881         1       2  ...  26.0000    NaN        S
887          888         1       1  ...  30.0000    B42        S
889          890         1       1  ...  30.0000   C148        C

[342 rows x 9 columns]

* Îã§Ïùå ÏΩîÎìúÎäî 3Îì±ÏÑù ÌÉëÏäπÍ∞ù Ï§ë ÏÉùÏ°¥Ìïú ÌÉëÏäπÍ∞ùÎßå ÌïÑÌÑ∞ÌïòÏó¨ Î≥¥Ïó¨Ï§å

In [ ]:
df.loc[(df.Pclass == 3) & (df.Survived == 1)]

     PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
2              3         1       3  ...   7.9250    NaN        S
8              9         1       3  ...  11.1333    NaN        S
10            11         1       3  ...  16.7000     G6        S
19            20         1       3  ...   7.2250    NaN        C
22            23         1       3  ...   8.0292    NaN        Q
..           ...       ...     ...  ...      ...    ...      ...
838          839         1       3  ...  56.4958    NaN        S
855          856         1       3  ...   9.3500    NaN        S
858          859         1       3  ...  19.2583    NaN        C
869          870         1       3  ...  11.1333    NaN        S
875          876         1       3  ...   7.2250    NaN        C

[119 rows x 9 columns]

* Îã§Ïùå ÏΩîÎìúÎäî 3Îì±ÏÑù ÌÉëÏäπÍ∞ù Ï§ë Ìã∞ÏºìÏùÑ 30ÌååÏö¥Îìú Ïù¥ÌïòÎ°ú Íµ¨ÏûÖÌïú ÌÉëÏäπÍ∞ùÏùÑ ÌïÑÌÑ∞Ìïú ÌõÑ Survived Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º Î≥¥Ïó¨Ï§å

In [ ]:
result = df.loc[(df.Pclass == 3) & (df.Fare <= 30)]
result.Survived

0      0
2      1
4      0
5      0
7      0
      ..
882    0
884    0
885    0
888    0
890    0
Name: Survived, Length: 450, dtype: int64

## DataFrame.loc[Ï°∞Í±¥Î¨∏, Ïª¨ÎüºÏù¥Î¶Ñ]

* DataFrame[Ï°∞Í±¥Î¨∏]ÏùÄ ÌïÑÌÑ∞ ÌõÑ Î™®Îì† Ïª¨ÎüºÏùò Îç∞Ïù¥ÌÑ∞ Í∞íÏùÑ Î≥¥Ïó¨Ï§å

* DataFrame[Ï°∞Í±¥Î¨∏]Í≥º ÎπÑÍµêÌïòÏó¨ DataFrame.loc Î©îÏÜåÎìú ÏÇ¨Ïö© Ïãú Í∞ÄÏû• ÌÅ∞ Ïù¥Ï†êÏùÄ ÌïÑÌÑ∞ ÌõÑ Î≥¥Ïó¨Ï£ºÍ≥† Ïã∂ÏùÄ columnÏùÑ ÏÑ†ÌÉùÌï† Ïàò ÏûàÏùå
* ÏòàÏª®Îç∞ 3Îì±ÏÑù ÌÉëÏäπÍ∞ù Ï§ë ÏÉùÏ°¥Ìïú ÌÉëÏäπÍ∞ùÏùÑ ÌïÑÌÑ∞ ÌõÑ Age Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Îßå Î≥¥Ïó¨Ï§Ñ Ïàò ÏûàÏùå

In [ ]:
df[(df.Pclass == 3) & (df.Survived == 1)]

     PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
2              3         1       3  ...   7.9250    NaN        S
8              9         1       3  ...  11.1333    NaN        S
10            11         1       3  ...  16.7000     G6        S
19            20         1       3  ...   7.2250    NaN        C
22            23         1       3  ...   8.0292    NaN        Q
..           ...       ...     ...  ...      ...    ...      ...
838          839         1       3  ...  56.4958    NaN        S
855          856         1       3  ...   9.3500    NaN        S
858          859         1       3  ...  19.2583    NaN        C
869          870         1       3  ...  11.1333    NaN        S
875          876         1       3  ...   7.2250    NaN        C

[119 rows x 9 columns]

In [ ]:
df.loc[(df.Pclass == 3) & (df.Survived == 1), 'Age']

2      26.0
8      27.0
10      4.0
19      NaN
22     15.0
       ...
838    32.0
855    18.0
858    24.0
869     4.0
875    15.0
Name: Age, Length: 119, dtype: float64

* ÌïÑÌÑ∞ ÌõÑ Î≥¥Ïó¨Ï£ºÍ≥† Ïã∂ÏùÄ Ïª¨ÎüºÏù¥ ÎëêÍ∞ú Ïù¥ÏÉÅÏù¥Î©¥ Î¶¨Ïä§Ìä∏Î•º ÎÑ£Ïñ¥Ï£ºÎ©¥ Îê®

In [ ]:
df.loc[(df.Pclass == 3) & (df.Survived == 1), ['Pclass','Survived','Age']]

     Pclass  Survived   Age
2         3         1  26.0
8         3         1  27.0
10        3         1   4.0
19        3         1   NaN
22        3         1  15.0
..      ...       ...   ...
838       3         1  32.0
855       3         1  18.0
858       3         1  24.0
869       3         1   4.0
875       3         1  15.0

[119 rows x 3 columns]

# Îç∞Ïù¥ÌÑ∞ ÏàòÏ†ï

## Îã®Ïùº Îç∞Ïù¥ÌÑ∞ ÏàòÏ†ï

### DataFrame.at / DataFrame.iat

* DataFrame.at ÎòêÎäî DataFrame.iatÎ•º ÏÇ¨Ïö©ÌïòÏó¨ Îã®Ïùº Îç∞Ïù¥ÌÑ∞Î•º ÏùΩÏñ¥Ïò§Îäî Î∞©Î≤ïÏóê ÎåÄÌï¥ Î∞∞Ïõ†Ïùå

* DataFrame.at ÎòêÎäî DataFrame.iatÎ•º ÏÇ¨Ïö©ÌïòÏó¨ Îã®Ïùº Îç∞Ïù¥ÌÑ∞Î•º ÏàòÏ†ïÌï† Ïàò ÏûàÏùå

#### DataFrame.at[Ïù∏Îç±Ïä§_Í∞í, Ïª¨Îüº_Ïù¥Î¶Ñ]

* DataFrame.at[Ïù∏Îç±Ïä§_Í∞í, Ïª¨Îüº_Ïù¥Î¶Ñ]Î•º ÏÇ¨Ïö©ÌïòÏó¨ index = 2, column = 'Pclass' Îç∞Ïù¥ÌÑ∞Î•º ÏàòÏ†ïÍ≤†Ïùå

* ÏàòÏ†ï Ï†Ñ, Î®ºÏ†Ä index = 2, column = 'Pclass' Îç∞Ïù¥ÌÑ∞ Í∞íÏùÑ ÌôïÏù∏ ÌïòÍ≤†Ïùå

In [ ]:
df = getTitanicData()
df.at[2, 'Pclass']

3

* index = 2, column = 'Pclass' Îç∞Ïù¥ÌÑ∞ Í∞íÏùÄ 3Ïù¥ÏòÄÏùå. Ïù¥ Í∞íÏùÑ 4Î°ú ÏàòÏ†ïÌïú ÌõÑ Ìï¥Îãπ Îç∞Ïù¥ÌÑ∞ Í∞íÏùÑ ÌôïÏù∏ ÌïòÍ≤†Ïùå

In [ ]:
df.at[2, 'Pclass'] = 4
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       4  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]

#### DataFrame.iat[Ïù∏Îç±Ïä§_Î≤àÌò∏, Ïª¨Îüº_Î≤àÌò∏]

* DataFrame.iat[Ïù∏Îç±Ïä§_Î≤àÌò∏, Ïª¨Îüº_Î≤àÌò∏]Î•º ÏÇ¨Ïö©ÌïòÏó¨ index_no = 2, column_no = 2 Îç∞Ïù¥ÌÑ∞Î•º 4Î°ú ÏàòÏ†ïÌïòÍ≤†Ïùå

In [ ]:
df = getTitanicData()
df.iat[2, 2]

3

In [ ]:
df.iat[2, 2] = 4
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       4  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]

### DataFrame.loc / DataFrame.iloc

#### DataFrame.loc[Ïù∏Îç±Ïä§_Í∞í, Ïª¨Îüº_Ïù¥Î¶Ñ]

* DataFrame.loc[Ïù∏Îç±Ïä§_Í∞í, Ïª¨Îüº_Ïù¥Î¶Ñ]Î•º ÏÇ¨Ïö©ÌïòÏó¨ index = 0, column = 'Pclass' Îç∞Ïù¥ÌÑ∞Î•º ÏàòÏ†ïÍ≤†Ïùå

* ÏàòÏ†ï Ï†Ñ, Î®ºÏ†Ä index = 2, column = 'Pclass' Îç∞Ïù¥ÌÑ∞ Í∞íÏùÑ ÌôïÏù∏ ÌïòÍ≤†Ïùå

In [ ]:
df = getTitanicData()
df.loc[0, 'Pclass']

3

In [ ]:
df.loc[0, 'Pclass'] = 4
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       4  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       3  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]

#### DataFrame.iloc[Ïù∏Îç±Ïä§_Î≤àÌò∏, Ïª¨Îüº_Î≤àÌò∏]

* DataFrame.loc[Ïù∏Îç±Ïä§_Î≤àÌò∏, Ïª¨Îüº_Î≤àÌò∏]Î•º ÏÇ¨Ïö©ÌïòÏó¨ index_no = 0, column_no = 2 Îç∞Ïù¥ÌÑ∞Î•º 4Î°ú ÏàòÏ†ïÌïòÍ≤†Ïùå

In [ ]:
df = getTitanicData()
df.iloc[0, 2]

22.0

In [ ]:
df.iloc[0, 2] = 4
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       3  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]

## Column ÏàòÏ†ï

### DataFrame[Ïª¨Îüº_Ïù¥Î¶Ñ]

* DataFrame[Ïª¨Îüº_Ïù¥Î¶Ñ]ÏùÑ ÏÇ¨Ïö©ÌïòÏó¨ Ìï¥Îãπ Ïù¥Î¶ÑÏùÑ Í∞ÄÏßÑ Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º ÏùΩÎäî Î≤ïÏùÑ Î∞∞Ïõ†Ïùå
* DataFrame[Ïª¨Îüº_Ïù¥Î¶Ñ]Ïóê ÏõêÌïòÎäî Í∞íÏùÑ Ìï†ÎãπÌïòÏó¨ Ïª¨Îüº Ï†ÑÏ≤¥ Îç∞Ïù¥ÌÑ∞Î•º ÏàòÏ†ïÎê®
* Pclass Ïª¨Îüº Ï†ÑÏ≤¥ Îç∞Ïù¥ÌÑ∞Î•º ÏàòÏ†ïÌïòÏó¨ Î≥¥Í≤†Ïùå. ÏàòÏ†ï Ï†ÑÏóê Pclass Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º Î®ºÏ†Ä ÌôïÏù∏ÌïòÍ≤†Ïùå

In [ ]:
df = getTitanicData()
df['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

* Pclass Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º 4Î°ú ÏàòÏ†ïÌïú ÌõÑ Pclass Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º ÌôïÏù∏ÌïòÍ≤†Ïùå

In [ ]:
df['Pclass'] = 4
df['Pclass']

0      4
1      4
2      4
3      4
4      4
      ..
886    4
887    4
888    4
889    4
890    4
Name: Pclass, Length: 891, dtype: int64

### DataFrame[ [ Ïª¨Îüº_Ïù¥Î¶Ñ$_0$ ,  Ïª¨Îüº_Ïù¥Î¶Ñ$_1$ ] ]

* DataFrame[ [ Ïª¨Îüº_Ïù¥Î¶Ñ$_0$ ,  Ïª¨Îüº_Ïù¥Î¶Ñ$_1$ ] ]ÏùÄ Ïª¨Îüº Ïù¥Î¶ÑÏùÑ Î¶¨Ïä§Ìä∏Î°ú ÎÑ£ÏúºÎ©¥ Ìï¥Îãπ Ïª¨ÎüºÎì§Ïùò  Îç∞Ïù¥ÌÑ∞Î•º ÏùΩÏùÑ Ïàò ÏûàÏùå

* DataFrame[ [ Ïª¨Îüº_Ïù¥Î¶Ñ$_0$ ,  Ïª¨Îüº_Ïù¥Î¶Ñ$_1$ ] ]Ïóê ÏõêÌïòÎäî Í∞íÏùÑ Ìï†ÎãπÌïòÎ©¥ Ìï¥Îãπ Ïª¨ÎüºÎì§Ïùò Îç∞Ïù¥ÌÑ∞Í∞Ä ÏàòÏ†ïÎê®

* PclassÏôÄ Sex Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º ÏàòÏ†ïÌïòÏó¨ Î≥¥Í≤†Ïùå

In [ ]:
df = getTitanicData()
df[['Pclass', 'Sex']]

     Pclass     Sex
0         3    male
1         1  female
2         3  female
3         1  female
4         3    male
..      ...     ...
886       2    male
887       1  female
888       3  female
889       1    male
890       3    male

[891 rows x 2 columns]

In [ ]:
df[['Pclass', 'Sex']] = 4
df[['Pclass', 'Sex']]

     Pclass  Sex
0         4    4
1         4    4
2         4    4
3         4    4
4         4    4
..      ...  ...
886       4    4
887       4    4
888       4    4
889       4    4
890       4    4

[891 rows x 2 columns]

### DataFrame.loc[ : , Ïª¨ÎüºÏù¥Î¶Ñ]

* DataFrame.loc[ : , Ïª¨ÎüºÏù¥Î¶Ñ]ÏùÑ ÏÇ¨Ïö©ÌïòÏó¨ ÌäπÏ†ï Ïª¨ÎüºÏùò Ï†ÑÏ≤¥ Îç∞Ïù¥ÌÑ∞Î•º ÏùΩÏùÑ Ïàò ÏûàÏùå

* DataFrame.loc[ : , Ïª¨ÎüºÏù¥Î¶Ñ]Ïóê ÏõêÌïòÎäî Í∞íÏùÑ Ìï†ÎãπÌïòÎ©¥ Ìï¥Îãπ Ïª¨ÎüºÏùò Îç∞Ïù¥ÌÑ∞Í∞Ä ÏàòÏ†ïÎê®

* Pclass Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º ÏàòÏ†ïÌïòÏó¨ Î≥¥Í≤†Ïùå

In [ ]:
df = getTitanicData()
df.loc[:, 'Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [ ]:
df.loc[:, 'Pclass'] = 4
df.loc[:, 'Pclass']

0      4
1      4
2      4
3      4
4      4
      ..
886    4
887    4
888    4
889    4
890    4
Name: Pclass, Length: 891, dtype: int64

### DataFrame.loc[ : , [Ïª¨Îüº_Ïù¥Î¶Ñ$_0$ ,  Ïª¨Îüº_Ïù¥Î¶Ñ$_1$]]

* DataFrame.loc[ : , [Ïª¨Îüº_Ïù¥Î¶Ñ$_0$ ,  Ïª¨Îüº_Ïù¥Î¶Ñ$_1$]]ÏùÑ ÏÇ¨Ïö©ÌïòÏó¨ ÌäπÏ†ï Ïª¨ÎüºÎì§Ïùò Ï†ÑÏ≤¥ Îç∞Ïù¥ÌÑ∞Î•º ÏùΩÏùÑ Ïàò ÏûàÏùå

* DataFrame.loc[ : , [Ïª¨Îüº_Ïù¥Î¶Ñ$_0$ ,  Ïª¨Îüº_Ïù¥Î¶Ñ$_1$]]Ïóê ÏõêÌïòÎäî Í∞íÏùÑ Ìï†ÎãπÌïòÎ©¥ Ìï¥Îãπ Ïª¨ÎüºÏùò Îç∞Ïù¥ÌÑ∞Í∞Ä ÏàòÏ†ïÎê®

* PclassÏôÄ Age Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º ÏàòÏ†ïÌïòÏó¨ Î≥¥Í≤†Ïùå

In [ ]:
df = getTitanicData()
df.loc[:, ['Pclass', 'Age']]

     Pclass   Age
0         3  22.0
1         1  38.0
2         3  26.0
3         1  35.0
4         3  35.0
..      ...   ...
886       2  27.0
887       1  19.0
888       3   NaN
889       1  26.0
890       3  32.0

[891 rows x 2 columns]

In [ ]:
df.loc[:, ['Pclass', 'Age']] = 4
df.loc[:, ['Pclass', 'Age']]

     Pclass  Age
0         4    4
1         4    4
2         4    4
3         4    4
4         4    4
..      ...  ...
886       4    4
887       4    4
888       4    4
889       4    4
890       4    4

[891 rows x 2 columns]

## Row ÏàòÏ†ï

### DataFrame[Ïù∏Îç±Ìä∏_ÏãúÏûëÎ≤àÌò∏ : Ïù∏ÌÖçÏä§_ÎÅùÎ≤àÌò∏]

* DataFrame[Ïù∏Îç±Ìä∏_ÏãúÏûëÎ≤àÌò∏ : Ïù∏ÌÖçÏä§_ÎÅùÎ≤àÌò∏]Î°ú Ìï¥Îãπ Î≤îÏúÑÏùò RowÎ•º ÏùΩÏùÑ Ïàò ÏûàÏùå
* DataFrame[Ïù∏Îç±Ìä∏_ÏãúÏûëÎ≤àÌò∏ : Ïù∏ÌÖçÏä§_ÎÅùÎ≤àÌò∏]Ïóê ÏõêÌïòÎäî Í∞íÏùÑ Ìï†ÎãπÌïòÎ©¥ Ìï¥Îãπ Row Îç∞Ïù¥ÌÑ∞Í∞Ä ÏàòÏ†ïÎê®

In [ ]:
df = getTitanicData()
df[0:2]

   PassengerId  Survived  Pclass     Sex  ...     Ticket     Fare  Cabin Embarked
0            1         0       3    male  ...  A/5 21171   7.2500    NaN        S
1            2         1       1  female  ...   PC 17599  71.2833    C85        C

[2 rows x 9 columns]

In [ ]:
df[0:2] = 1
df[0:2]

   PassengerId  Survived  Pclass Sex  Age Ticket  Fare Cabin Embarked
0            1         1       1   1    1      1   1.0     1        1
1            1         1       1   1    1      1   1.0     1        1

### DataFrame.loc[Ïù∏Îç±Ïä§_Í∞í]

In [ ]:
df = getTitanicData()
df.loc[0]

PassengerId            1
Survived               0
Pclass                 3
Sex                 male
Age                   22
Ticket         A/5 21171
Fare                7.25
Cabin                NaN
Embarked               S
Name: 0, dtype: object

In [ ]:
df.loc[0] = 3
df.loc[0]

PassengerId    3
Survived       3
Pclass         3
Sex            3
Age            3
Ticket         3
Fare           3
Cabin          3
Embarked       3
Name: 0, dtype: object

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...    Fare  Cabin Embarked
0            3         3       3  ...   3.000      3        3
1            1         1       1  ...   1.000      1        1
2            3         1       4  ...   7.925    NaN        S
3            4         1       4  ...  53.100   C123        S
4            5         0       4  ...   8.050    NaN        S

[5 rows x 9 columns]

In [ ]:
df.head()

     PassengerId  Survived  Pclass  ...    Fare  Cabin Embarked
0            NaN       NaN     NaN  ...     NaN    NaN      NaN
1            1.0       1.0     1.0  ...   1.000      1        1
2            3.0       1.0     4.0  ...   7.925    NaN        S
3            4.0       1.0     4.0  ...  53.100   C123        S
4            5.0       0.0     4.0  ...   8.050    NaN        S
..           ...       ...     ...  ...     ...    ...      ...
886        887.0       0.0     4.0  ...  13.000    NaN        S
887        888.0       1.0     4.0  ...  30.000    B42        S
888        889.0       0.0     4.0  ...  23.450    NaN        S
889        890.0       1.0     4.0  ...  30.000   C148        C
890        891.0       0.0     4.0  ...   7.750    NaN        Q

[891 rows x 9 columns]

## Row Î≤îÏúÑ + Column Î≤îÏúÑ Îç∞Ïù¥ÌÑ∞ ÏàòÏ†ï

* DataFrame.loc[Ïù∏Îç±Ïä§_Í∞í_ÏãúÏûë:Ïù∏Îç±Ïä§_Í∞í_ÎÅù, [Ïª¨Îüº_Ïù¥Î¶Ñ]]ÏùÑ ÏÇ¨Ïö©ÌïòÏó¨ Ìï¥Îãπ Row Î≤îÏúÑÏôÄ Column Î≤îÏúÑÏùò Îç∞Ïù¥ÌÑ∞Îßå ÏùΩÏùÑ Ïàò ÏûàÏùå

* DataFrame.loc[Ïù∏Îç±Ïä§_Í∞í_ÏãúÏûë:Ïù∏Îç±Ïä§_Í∞í_ÎÅù, [Ïª¨Îüº_Ïù¥Î¶Ñ]]Ïóê ÏõêÌïòÎäî Í∞íÏùÑ Ìï†ÎãπÌïòÎ©¥ Ìï¥Îãπ Row Î≤îÏúÑÏôÄ Column Î≤îÏúÑÏùò Îç∞Ïù¥ÌÑ∞Îßå Í∞íÏù¥ ÏàòÏ†ïÎê®

* Ïù¥ Î∞©Î≤ïÏùÄ indexÍ∞Ä Ïà´Ïûê ÏùºÎïåÎßå ÏÇ¨Ïö© Í∞ÄÎä•Ìï®. Ïà´ÏûêÍ∞Ä ÏïÑÎãàÎùºÎ©¥ DataFrame.ilocÏùÑ ÏÇ¨Ïö©ÌïòÏó¨Ïïº Ìï®

In [ ]:
df = getTitanicData()
df.loc[0:2, 'Pclass']

0    3
1    1
2    3
Name: Pclass, dtype: int64

In [ ]:
df.loc[0:2, 'Pclass'] = 4
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       4  ...   7.2500    NaN        S
1            2         1       4  ...  71.2833    C85        C
2            3         1       4  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]

* Ïª¨Îüº Ïù¥Î¶ÑÏù¥ ÎëêÍ∞ú Ïù¥ÏÉÅÏù¥Î©¥ Ïª¨Îüº Ïù¥Î¶ÑÏùÑ listÎ°ú ÎÑ£Ïñ¥Ï£ºÎ©¥ Îê®

In [ ]:
df = getTitanicData()
df.loc[0:2, ['Pclass', 'Sex']]

   Pclass     Sex
0       3    male
1       1  female
2       3  female

In [ ]:
df.loc[0:2, ['Pclass', 'Sex']] = 3
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       3  ...  71.2833    C85        C
2            3         1       3  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]

* ÏãúÏûë:ÎÅù Î≤îÏúÑ ÎåÄÏã† rowÍ∞íÏùÑ listÎ°ú ÎÑ£Ïñ¥Ï£ºÎ©¥ Îê®

In [ ]:
df = getTitanicData()
df.loc[[0,2], ['Pclass', 'Sex']]

   Pclass     Sex
0       3    male
2       3  female

In [ ]:
df.loc[[0,2], ['Pclass', 'Sex']] = 3
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0            1         0       3  ...   7.2500    NaN        S
1            2         1       1  ...  71.2833    C85        C
2            3         1       3  ...   7.9250    NaN        S
3            4         1       1  ...  53.1000   C123        S
4            5         0       3  ...   8.0500    NaN        S

[5 rows x 9 columns]

## ÌïÑÌÑ∞ÎßÅÎ•º ÌôúÏö©Ìïú Îç∞Ïù¥ÌÑ∞ ÏàòÏ†ï 

* ÏúÑÏóêÏÑú ÌïÑÌÑ∞ÎßÅ ÌïòÎäî Î∞©Î≤ïÏùÑ Î∞∞Ïõ†Ïùå. ÌïÑÌÑ∞ÎßÅ Í≤∞Í≥ºÏóê ÏõêÌïòÎäî Í∞íÏùÑ Ìï†ÎãπÌïòÎ©¥ Ìï¥Îãπ Îç∞Ïù¥ÌÑ∞Îßå ÏàòÏ†ïÎê®

### DataFrame[Ï°∞Í±¥Î¨∏]

* DataFrame[Ï°∞Í±¥Î¨∏]ÏùÄ Ï°∞Í±¥Î¨∏Ïù¥ TrueÎ•º Î∞òÌôòÌïòÎäî RowÎßå Î≥¥Ïó¨Ï§å

* DataFrame[Ï°∞Í±¥Î¨∏] Í≤∞Í≥ºÏóê ÏõêÌïòÎäî Îç∞Ïù¥ÌÑ∞Î•º Ìï†ÎãπÌïòÎ©¥ Î∞òÌôòÎêòÎäî Row Îç∞Ïù¥ÌÑ∞Í∞Ä ÏàòÏ†ïÎê®

* ÏÉùÏ°¥Ïûê (df.Survived == 1) Îç∞Ïù¥ÌÑ∞Î•º Î™®Îëê 3ÏúºÎ°ú ÏàòÏ†ïÌïòÏó¨ Î≥¥Í≤†Ïùå. ÏàòÏ†ï Ï†ÑÏóê ÏÉùÏ°¥Ïûê Îç∞Ïù¥ÌÑ∞Î•º Î®ºÏ†Ä ÌôïÏù∏Ìï¥ Î≥¥Í≤†Ïùå

In [ ]:
df = getTitanicData()
df[df.Survived == 1]

     PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
1              2         1       1  ...  71.2833    C85        C
2              3         1       3  ...   7.9250    NaN        S
3              4         1       1  ...  53.1000   C123        S
8              9         1       3  ...  11.1333    NaN        S
9             10         1       2  ...  30.0708    NaN        C
..           ...       ...     ...  ...      ...    ...      ...
875          876         1       3  ...   7.2250    NaN        C
879          880         1       1  ...  83.1583    C50        C
880          881         1       2  ...  26.0000    NaN        S
887          888         1       1  ...  30.0000    B42        S
889          890         1       1  ...  30.0000   C148        C

[342 rows x 9 columns]

* ÏÉùÏ°¥Ïûê Îç∞Ïù¥ÌÑ∞Î•º 3ÏúºÎ°ú ÏàòÏ†ïÌïòÏòÄÏùå. Îî∞ÎùºÏÑú df.Survived == 1 Ï°∞Í±¥Î¨∏Ïóê Ìï¥ÎãπÌïòÎäî Îç∞Ïù¥ÌÑ∞Îäî ÏóÜÏùå

In [ ]:
df[df.Survived == 1] = 3
df[df.Survived == 1]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Sex, Age, Ticket, Fare, Cabin, Embarked]
Index: []

* df.Survived == 1Ïù¥ ÏòÄÎçò Îç∞Ïù¥ÌÑ∞Îì§ÏùÄ Î™®Îëê 3ÏúºÎ°ú Î≥ÄÍ≤ΩÎêòÏóàÏùå. Îî∞ÎùºÏÑú df.Survived == 3ÏúºÎ°ú ÌôïÏù∏Ìï¥ Î≥¥Í≤†Ïùå

In [ ]:
df[df.Survived == 3]

     PassengerId  Survived  Pclass Sex  Age Ticket  Fare Cabin Embarked
1              3         3       3   3  3.0      3   3.0     3        3
2              3         3       3   3  3.0      3   3.0     3        3
3              3         3       3   3  3.0      3   3.0     3        3
8              3         3       3   3  3.0      3   3.0     3        3
9              3         3       3   3  3.0      3   3.0     3        3
..           ...       ...     ...  ..  ...    ...   ...   ...      ...
875            3         3       3   3  3.0      3   3.0     3        3
879            3         3       3   3  3.0      3   3.0     3        3
880            3         3       3   3  3.0      3   3.0     3        3
887            3         3       3   3  3.0      3   3.0     3        3
889            3         3       3   3  3.0      3   3.0     3        3

[342 rows x 9 columns]

### DataFrame.loc[Ï°∞Í±¥Î¨∏, Ïª¨ÎüºÏù¥Î¶Ñ] 
* Îç∞Ïù¥ÌÑ∞ ÌïÑÌÑ∞ÎßÅ ÌõÑ Ï†ÑÏ≤¥ Îç∞Ïù¥ÌÑ∞Í∞Ä ÏïÑÎãå ÌäπÏ†ï columnÎßå ÏàòÏ†ïÌïòÎäî Î∞©Î≤ïÏóê ÎåÄÌï¥ Î∞∞Ïö∞Í≤†Ïùå

* DataFrame.loc[Ï°∞Í±¥Î¨∏, Ïª¨ÎüºÏù¥Î¶Ñ]ÏúºÎ°ú Îç∞Ïù¥ÌÑ∞ ÌïÑÌÑ∞ÎßÅ ÌõÑ ÌäπÏ†ï column Îç∞Ïù¥ÌÑ∞Îßå ÏùΩÏùÑ Ïàò ÏûàÏùå

* DataFrame.loc[Ï°∞Í±¥Î¨∏, Ïª¨ÎüºÏù¥Î¶Ñ]Ïóê ÏõêÌïòÎäî Í∞íÏùÑ Ìï†ÎãπÌïòÎ©¥ Ìï¥Îãπ column Îç∞Ïù¥ÌÑ∞Îßå ÏàòÏ†ïÎê®

In [ ]:
df = getTitanicData()
df.loc[df.Survived == 0, 'Pclass']

0      3
4      3
5      3
6      1
7      3
      ..
884    3
885    3
886    2
888    3
890    3
Name: Pclass, Length: 549, dtype: int64

In [ ]:
df.loc[df.Survived == 0, 'Pclass'] = 4
df.loc[df.Survived == 0, 'Pclass']

0      4
4      4
5      4
6      4
7      4
      ..
884    4
885    4
886    4
888    4
890    4
Name: Pclass, Length: 549, dtype: int64

In [ ]:
df

     PassengerId  Survived  Pclass  ...     Fare  Cabin Embarked
0              1         0       4  ...   7.2500    NaN        S
1              2         1       1  ...  71.2833    C85        C
2              3         1       3  ...   7.9250    NaN        S
3              4         1       1  ...  53.1000   C123        S
4              5         0       4  ...   8.0500    NaN        S
..           ...       ...     ...  ...      ...    ...      ...
886          887         0       4  ...  13.0000    NaN        S
887          888         1       1  ...  30.0000    B42        S
888          889         0       4  ...  23.4500    NaN        S
889          890         1       1  ...  30.0000   C148        C
890          891         0       4  ...   7.7500    NaN        Q

[891 rows x 9 columns]

* Ïù¥Î≤àÏóêÎäî 2Í∞úÏùò Ïª¨Îüº Îç∞Ïù¥ÌÑ∞Î•º ÏàòÏ†ïÌïòÏó¨ Î≥¥Í≤†Ïùå

In [ ]:
df = getTitanicData()
df.loc[df.Survived == 0, ['Pclass', 'Age']]

     Pclass   Age
0         3  22.0
4         3  35.0
5         3   NaN
6         1  54.0
7         3   2.0
..      ...   ...
884       3  25.0
885       3  39.0
886       2  27.0
888       3   NaN
890       3  32.0

[549 rows x 2 columns]

In [ ]:
df.loc[df.Survived == 0, ['Pclass', 'Age']] = 4
df.loc[df.Survived == 0, ['Pclass', 'Age']]

     Pclass  Age
0         4  4.0
4         4  4.0
5         4  4.0
6         4  4.0
7         4  4.0
..      ...  ...
884       4  4.0
885       4  4.0
886       4  4.0
888       4  4.0
890       4  4.0

[549 rows x 2 columns]